import React from 'react';
import Navbar from '../../Navigation/Navbar/Navbar';
import Footer from '../../Navigation/Footer/Footer';

const About = () => {
    const about =
      "বাংলাদেশ সরকার কর্তৃক বিনামূল্যে বিতরণকৃত পাঠ্যপুস্তকসমূহকে সাধারণ শিক্ষার্থীদের দোরগোড়ায় পৌঁছে দিতে আমাদের এই ই-বুক সেলফ প্ল্যাটফর্ম একটি ডিজিটাল সহযোগী হিসেবে কাজ করছে। প্রযুক্তির এই আধুনিক যুগে শিক্ষার আলো ছড়িয়ে দিতে এবং পড়াশোনাকে আরও সহজলভ্য করতে আমরা সম্পূর্ণ বিনামূল্যে এই সেবাটি চালু করেছি। অনেক সময় শিক্ষার্থীদের কাছে কাগজের মূল বই পৌঁছাতে দেরি হতে পারে, কিংবা দূরদূরান্তের প্রান্তিক অঞ্চলের শিক্ষার্থীদের জন্য তাৎক্ষণিকভাবে বই সংগ্রহ করা কঠিন হয়ে পড়ে। আপনাদের সহযোগিতার আয়োজন আমাদের এই ই-বুক সেলফ প্ল্যাটফর্মটি ঠিক এই জায়গাতেই সমাধান হিসেবে কাজ করছে। এখানে সরকারের নির্ধারিত প্রাথমিক, মাধ্যমিক ও উচ্চ মাধ্যমিক স্তরের জাতীয় শিক্ষাক্রমের সকল ই-বুক অত্যন্ত সুশৃঙ্খলভাবে সাজানো রয়েছে। শিক্ষার্থীরা যেকোনো সময়, যেকোনো স্থান থেকে সম্পূর্ণ বিনামূল্যে তাদের প্রয়োজনীয় বইগুলো পড়া ও ডাউনলোড করার সুযোগ পাচ্ছে। একটি স্মার্ট বাংলাদেশ বিনির্মাণে এবং শতভাগ ডিজিটাল শিক্ষা নিশ্চিত করতে সরকারি এই মহৎ উদ্যোগকে সফল করাই আমাদের মূল লক্ষ্য। আমাদের এই ক্ষুদ্র প্রচেষ্টার মাধ্যমে যদি একজন শিক্ষার্থীরও পড়াশোনার যাত্রা সহজ হয়, তবেই আমাদের এই প্ল্যাটফর্মের সার্থকতা আসবে। আসুন, আমরা সবাই মিলে শিক্ষার আলো ছড়িয়ে দিই এবং একটি শিক্ষিত ও সমৃদ্ধ আগামী প্রজন্ম গড়ে তুলি।";
    return (
      <div className="text-justify">
        <Navbar />
        <div className='p-10 shadow-2xl min-h-screen'>{about}</div>
        <Footer />
      </div>
    );
};

export default About;